app/controllers/advertisements_controller.rb

  def create
    @advertisement = current_user.account.advertisements.build params[:advertisement]

    respond_to do |format|
      if @advertisement.save
---
INSERT INTO `advertisements` (`company`, `updated_at`, `account_id`, `title`, `logo_size`, `url`, `logo_file_name`, `orientation`, `description`, `logo_content_type`, `state`, `created_at`) VALUES('Toby Greenleaf', '2010-08-18 18:41:59', 1, '', NULL, 'http://www.freeonlinehomefinder.com', 'coachtobyad.JPG', NULL, '', 'image/jpeg', NULL, '2010-08-18 18:41:59')

  def edit
    @advertisement = current_user.account.advertisements.find params[:id]
---
SELECT * FROM `accounts` WHERE (`accounts`.`id` = 1)
SELECT * FROM `advertisements` WHERE (`advertisements`.`id` = 2 AND (`advertisements`.account_id = 1))

  def update
    @advertisement = current_user.account.advertisements.find params[:id]
    respond_to do |format|
      if @advertisement.update_attributes params[:advertisement]
---
SELECT * FROM `accounts` WHERE (`accounts`.`id` = 1)
SELECT * FROM `advertisements` WHERE (`advertisements`.`id` = 2 AND (`advertisements`.account_id = 1))
UPDATE `advertisements` SET `title` = 'What offseason?!', `description` = '', `updated_at` = '2010-08-19 12:20:02' WHERE `id` = 2