app/controllers/team_followers_controller.rb

  def index
    team_ids = current_user.team_ids || session[:team_ids]
    @team_ids = team_ids.nil? ? [ ] : team_ids.map(&:to_i)
---
SELECT `teams`.id FROM `teams` INNER JOIN `team_followers` ON `teams`.id = `team_followers`.team_id WHERE ((`team_followers`.user_id = 2))

  def create
    respond_to do |format|
      format.html{
        team_ids = params[:team_follower].collect do |team_id, team_attr|
          team_attr[:team_id] != '0' ? team_id : nil
        end
        team_ids.compact!

        session[:team_ids] = team_ids

        unless params[:user].blank? || params[:user][:email].blank?
          user = User.new params[:user]
          UserSession.create(params[:user_session].merge(:email => user.email, :password=>user.password) ) if user.save
        end

        unless current_user.is_a? Guest
          current_user.team_ids = team_ids
        end

        redirect_to schedules_path
      }
      format.json{
        if session[:team_ids].nil?
          session[:team_ids] = current_user.is_a?(Guest) ? [ ] : current_user.team_ids
        end

        Rails.logger.info "Added #{params[:team_follower][:team_id]} to #{session[:team_ids]}"

        session[:team_ids] << params[:team_follower][:team_id].to_i
---
SELECT `users`.id FROM `users` WHERE (LOWER(`users`.`email`) = BINARY 'arv7@cornell.edu') LIMIT 1
INSERT INTO `users` (`name`, `updated_at`, `reminders`, `crypted_password`, `password_salt`, `admin`, `persistence_token`, `email`, `created_at`) VALUES('Dawn Vanasse', '2010-03-11 19:28:38', 1, '057a25b860dbfc4145ca799f8f771c82d299680bf734255f084e88b88a1ba0a39daeb6b8fe5fc1c3e76b480fc48937e2634fca8dab38fd33ee160109f94d8304', 'xRSkPeN7QDt0nYyMMDfe', NULL, '11fae8fea5d3842241fcfcc37b5b2bb02c679a3d6e07809a30d310f51499a407c1a9e5821c70ec42ab511324bec1e2405a88966b47ea26e0efd00463d5e31fb7', 'arv7@cornell.edu', '2010-03-11 19:28:38')
INSERT INTO `team_followers` (`team_id`, `updated_at`, `user_id`, `created_at`) VALUES(35, '2010-03-11 19:28:38', 2, '2010-03-11 19:28:38')