app/controllers/teams_controller.rb

INSERT INTO `teams` (`name`, `updated_at`, `url`, `created_at`) VALUES('Tsunami', '2010-02-25 03:18:33', 'http://carolinaelitesc.demosphere.com/teams/20208754/20665563-20208848/TEAM.html', '2010-02-25 03:18:33')
---
  def create
    @team = Team.new params[:team]
    respond_to do |format|
      if @team.save